# app_Dpe/constants.py

# ------------------------ WILAYAS ------------------------

WILAYAS = [
    ("01", "تونس"),
    ("02", "أريانة"),
    ("03", "بن عروس"),
    ("04", "منوبة"),
    ("05", "نابل"),
    ("06", "زغوان"),
    ("07", "بنزرت"),
    ("08", "جندوبة"),
    ("09", "الكاف"),       
    ("10", "سليانة"),      
    ("11", "القيروان"),
    ("12", "القصرين"),
    ("13", "سيدي بوزيد"),
    ("14", "سوسة"),
    ("15", "المنستير"),
    ("16", "المهدية"),
    ("17", "صفاقس"),
    ("18", "قابس"),
    ("19", "مدنين"),
    ("20", "تطاوين"),
    ("21", "قبلي"),
    ("22", "توزر"),
    ("23", "قفصة"),
    ("24", "باجة"),
]


# ------------------------ ROLES ------------------------
ROLES = [
    ("central", "مركزي"),
    ("regional", "جهوي"),
    ("local", "محلي"),
]

# ------------------------ THREATS LABELS (optionnel) ------------------------
THREATS_LABELS = {
    "loss": {
        "parents_dead": "وفاة الأبوين",
        "absence_parent": "غياب أحد الأبوين",
        "no_civil_registration": "عدم التسجيل بالحالة المدنية",
    },
    "neglect": {
        "hygiene_food": "سوء النظافة أو التغذية",
        "homeless": "التشرد",
    },
    "care": {
        "no_school": "عدم التمدرس",
        "violence": "العنف داخل الأسرة",
    },
    "guardian": {
        "begging": "التسول",
        "runaway": "الهروب من المنزل",
        "dangerous_behavior": "سلوك خطير",
    }
}
